FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
        return false;
    }

    if (step_motor_initialize(
            &manager->motor,
            &(step_motor_config_t){
                .min_position = manager->parameters.min_position,
                .max_position = manager->parameters.max_position,
                .min_speed = manager->parameters.min_speed,
                .max_speed = manager->parameters.max_speed,
                .step_change = manager->parameters.step_change},
            &(step_motor_interface_t){
                .device_user = manager,
                .device_initialize = step_motor_device_initialize,
                .device_deinitialize = step_motor_device_deinitialize,
                .device_set_frequency = step_motor_device_set_frequency,
                .device_set_direction = step_motor_device_set_direction},
            0.0F) != STEP_MOTOR_ERR_OK) {
        ATLAS_LOG(TAG, "Failed step_motor_initialize");

        return false;
    }

    if (pid_regulator_initialize(
            &manager->regulator,
            &(pid_regulator_config_t){
                .prop_gain = manager->parameters.prop_gain,
                .int_gain = manager->parameters.int_gain,
                .dot_gain = manager->parameters.dot_gain,
                .sat_gain = manager->parameters.sat_gain,
                .min_control = manager->parameters.min_speed,
                .max_control = manager->parameters.max_speed,
                .dead_error = manager->parameters.dead_error}) !=
        PID_REGULATOR_ERR_OK) {
        ATLAS_LOG(TAG, "Failed pid_regulator_initialize");

        return false;
    }

    if (motor_driver_initialize(
            &manager->driver,
            &(motor_driver_config_t){
                .min_position = manager->parameters.min_position,
                .max_position = manager->parameters.max_position,
                .min_speed = manager->parameters.min_speed,
                .max_speed = manager->parameters.max_speed,
                .min_acceleration = manager->parameters.min_acceleration,
                .max_acceleration = manager->parameters.max_acceleration,
                .max_current = manager->parameters.current_limit},
            &(motor_driver_interface_t){
                .motor_user = manager,
                .motor_initialize = motor_driver_motor_initialize,
                .motor_deinitialize = motor_driver_motor_deinitialize,
                .motor_set_speed = motor_driver_motor_set_speed,
                .encoder_user = manager,
                .encoder_initialize = motor_driver_encoder_initialize,
                .encoder_deinitialize = motor_driver_encoder_deinitialize,
                .encoder_get_position = motor_driver_encoder_get_position,
                .regulator_user = manager,
                .regulator_initialize = motor_driver_regulator_initialize,
                .regulator_deinitialize = motor_driver_regulator_deinitialize,
                .regulator_get_control = motor_driver_regulator_get_control,
                .fault_user = manager,
                .fault_initialize = motor_driver_fault_initialize,
                .fault_deinitialize = motor_driver_fault_deinitialize,
                .fault_get_current = motor_driver_fault_get_current}) !=
        MOTOR_DRIVER_ERR_OK) {
        ATLAS_LOG(TAG, "Failed motor_driver_initialize");

        return false;
    }

    return true;
}

static inline bool joint_manager_deinitialize_drivers(joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);

    if (as5600_deinitialize(&manager->as5600) != AS5600_ERR_OK) {
        ATLAS_LOG(TAG, "Failed as5600_deinitialize");

        return false;
    }

    // if (ina226_deinitialize(&manager->ina226) != INA226_ERR_OK) {
    //     ATLAS_LOG(TAG, "Failed ina226_deinitialize");

    //     return false;
    // }

    if (drv8825_deinitialize(&manager->drv8825) != DRV8825_ERR_OK) {
        ATLAS_LOG(TAG, "Failed drv8825_deinitialize");

        return false;
    }

    if (step_motor_deinitialize(&manager->motor) != STEP_MOTOR_ERR_OK) {
        ATLAS_LOG(TAG, "Failed step_motor_deinitialize");

        return false;
    }

    if (pid_regulator_deinitialize(&manager->regulator) !=
        PID_REGULATOR_ERR_OK) {
        ATLAS_LOG(TAG, "Failed pid_regulator_deinitialize");

        return false;
    }

    if (motor_driver_deinitialize(&manager->driver) != MOTOR_DRIVER_ERR_OK) {
        ATLAS_LOG(TAG, "Failed motor_driver_deinitialize");

        return false;
    }

    return true;
}

static atlas_err_t joint_manager_notify_delta_elapsed_handler(
    joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);
    ATLAS_LOG_FUNC(TAG);

    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    if (manager->reference.delta_time == 0.0F || manager->has_fault) {
        return ATLAS_ERR_FAIL;
    }

    motor_driver_err_t err =
        motor_driver_set_position(&manager->driver,
                                  manager->reference.position,
                                  manager->reference.delta_time);

    if (err != MOTOR_DRIVER_ERR_OK) {
        system_event_t event = {.origin = SYSTEM_EVENT_ORIGIN_JOINT,
                                .type = SYSTEM_EVENT_TYPE_JOINT_FAULT,
                                .payload.joint_fault = {}};
        if (!joint_manager_send_system_event(&event)) {
            return ATLAS_ERR_FAIL;
        }

        motor_driver_set_speed(&manager->driver,
                               0.0F,
                               manager->reference.delta_time);
        manager->has_fault = true;

        return ATLAS_ERR_OK;
    }

    motor_driver_state_t state;
    motor_driver_get_state(&manager->driver, &state);

    ATLAS_LOG(TAG,
              "measure position: %f, reference position: %f, error position: "
              "%f, control speed: %f, fault current: %f",
              state.measure_position,
              manager->reference.position,
              state.measure_position - manager->reference.position,
              state.control_speed,
              state.fault_current);

